app/controllers/manager/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY cat_id desc
---
  def index
    @categories = Category.all

INSERT INTO `categories` (`cat_id`, `cat_name`, `cat_content`, `created_at`, `updated_at`) VALUES (1, 'test1', 'this is a test1', '2018-08-09 04:14:16', '2018-08-09 04:14:16')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save