app/controllers/carts_controller.rb

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 1

    def set_cart
      begin
        @cart=Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 4 LIMIT 1