app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2018-08-07 06:59:42', '2018-08-07 06:59:42')
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`) VALUES (2, 1, '2018-08-07 06:59:42', '2018-08-07 06:59:42')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2018-08-07 07:13:14' WHERE `line_items`.`id` = 1
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT  `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 1 LIMIT 1
---
    def set_line_item
      @line_item = LineItem.find(params[:id])