app/controllers/products_controller.rb

INSERT INTO `products` (`title`, `description`, `image_url`, `price`, `created_at`, `updated_at`) VALUES ('Web developer', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Atque autem consectetur corporis cum debitis deleniti eum exercitationem, impedit ipsum laborum modi praesentium quibusdam, quos repellat repellendus reprehenderit ullam vitae voluptate!', '/images/1.jpg', 43.95, '2018-08-07 06:12:00', '2018-08-07 06:12:00')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save